Revit 2027 API
BuiltInFailures.SketchFailures.TrussShiftedReferences Property
 Truss top and bottom references (chains of one or more reference lines) must overlap at least partially in the vertical direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussShiftedReferences { get; }
Public Shared ReadOnly Property TrussShiftedReferences As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussShiftedReferences {
	FailureDefinitionId^ get ();
}
static member TrussShiftedReferences : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace